chore: ready to build glob-hook
